import {Header} from '../../components/Header/Header.jsx';
import {Footer} from '../../components/Footer/Footer.jsx';

export const Home = () => {
    return (
        <div className="Home">
            <Header/>
            {/* hero section */}
            <section>
                <div>
                    <h2>Відкрий Україну заново — еко-мандри для натхнення</h2>
                    <p>Подорожуй екологічно, відкривай заповідні місця, гори та річки України. Ми зібрали маршрути, які допоможуть побачити красу природи без шкоди для неї.</p>
                    <button> Доєднатись до мандрів</button>
                </div>
                <img src="" alt="" />
            </section>
            {/* popular section */}
            <section>
                <div>
                <h2>Популярні статті</h2>
                <button>Всі статті</button>
                </div>
                <ul>
                    {/* <li>
                        <img src="" alt="" />
                        <div>
                            <p></p>
                            <h3></h3>
                            <button>Переглянути статтю</button>
                            <button>
                            <svg xmlns="http://www.w3.org/2000/svg" width="25" height="25" viewBox="0 0 25 25" fill="none">
  <path d="M12.6666 18.5007L7.89809 20.5407C7.33042 20.7854 6.79167 20.7395 6.28184 20.403C5.77201 20.0665 5.51709 19.5903 5.51709 18.9745V4.76198C5.51709 4.30032 5.68601 3.90007 6.02384 3.56123C6.36151 3.22223 6.76034 3.05273 7.22034 3.05273H18.1128C18.5745 3.05273 18.9748 3.22223 19.3136 3.56123C19.6526 3.90007 19.8221 4.30032 19.8221 4.76198V18.9745C19.8221 19.5903 19.5662 20.0665 19.0543 20.403C18.5425 20.7395 18.0028 20.7854 17.4351 20.5407L12.6666 18.5007ZM12.6666 16.6785L18.1128 18.9745V4.76198H7.22034V18.9745L12.6666 16.6785ZM12.6666 4.76198H7.22034H18.1128H12.6666Z" fill="black"/>
</svg>
                            </button>
                        </div>
                    </li>
                    li template */}
                </ul>
            </section>
            {/* eco section */}
            <section>
                <div>
                    <h2>Мандруй екологічно та відкривай нові горизонти</h2>
                    <p>Наш проєкт створений для тих, хто хоче досліджувати Україну відповідально. Ми допоможемо знайти унікальні маршрути, які поєднують красу природи, локальну культуру та принципи сталого туризму.</p>
                    <div>
                        <h3>Еко-маршрути по Україні</h3>
                        <p>Від Карпат до Чорного моря — добірка локацій, де можна подорожувати без шкоди для довкілля.</p>

                        <h3>Практичні екологічні поради</h3>
                        <p>Дізнайся, як зменшити свій екологічний слід під час мандрів, та зробити подорож комфортною й свідомою.</p>
                    </div>
                </div>
                <img src="" alt="" />
            </section>
            {/* our travellers section */}
            <section>
                <div>
                    <h2>Наші Мандрівники</h2>
                    <button>Всі мандрівники</button>
                </div>
                <ul>
                    {/* <li>
                        <img src="" alt="" />
                        <div>
                            <h3></h3>
                            <p></p>
                            <button>Переглянути профіль</button>
                        </div>
                    </li>
                    li template */}
                </ul>
            </section>
            {/* join us section */}
            <section>
                <h2>Приєднуйся до спільноти свідомих мандрівників</h2>
                <p>Стань частиною ком’юніті, де подорожі стають не лише пригодою, а й внеском у збереження природи. Тут ти знайдеш однодумців, поради для сталих мандрів та натхнення для нових маршрутів Україною.</p>
                <button>Зареєструватися</button>
            </section>
            <Footer/>
        </div>
    )
}