import { Header } from '../../components/Header/Header.jsx';
import { Footer } from '../../components/Footer/Footer.jsx';

export const Story = () => {
    return (
        <div className='Story'>
            <Header />
            {/* hero section */}
            <section>
                <div>
                    <div>
                        <button>
                            <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                                <path d="M14.0371 6.64844C14.1379 6.64844 14.2149 6.67885 14.293 6.75684C14.3711 6.83496 14.4014 6.91179 14.4014 7.0127C14.4014 7.1136 14.3711 7.19043 14.293 7.26855L9.58594 11.9756L9.93945 12.3291L14.293 16.6816C14.3707 16.7594 14.3926 16.8265 14.3896 16.9072C14.3861 17.0012 14.3542 17.0822 14.2686 17.168C14.1905 17.246 14.1135 17.2773 14.0127 17.2773C13.9118 17.2773 13.835 17.2461 13.7568 17.168L8.8125 12.2246C8.78534 12.1974 8.76548 12.1732 8.75098 12.1523L8.72168 12.0996C8.70687 12.0641 8.69829 12.0242 8.69824 11.9756C8.69824 11.9513 8.70011 11.9287 8.7041 11.9082L8.72168 11.8506C8.73339 11.8224 8.75834 11.7798 8.8125 11.7256L13.7822 6.75684C13.8602 6.67903 13.9365 6.64851 14.0371 6.64844Z" fill="#1B391B" stroke="#1B391B" />
                            </svg>
                            Всі статті
                        </button>
                        <h2>Карпати для новачків: легкі маршрути вихідного дня</h2>
                        <div>
                            <p>Автор статті</p>
                            <p>Опубліковано</p>
                            <button>Маршрути</button>
                        </div>
                    </div>
                    <img src="" alt="" />
                </div>
                <p>Карпати – це ідеальне місце для тих, хто тільки починає відкривати для себе світ гірських мандрівок. Тут можна знайти безліч маршрутів, які не потребують спеціальної підготовки чи складного спорядження, але водночас дарують неймовірні враження від природи. Легкі стежки пролягають через зелені пагорби, мальовничі полонини та соснові ліси, де кожен крок наповнює подорож спокоєм і свіжим повітрям.
                    Одним із популярних напрямків є прогулянки до невеликих вершин, з яких відкриваються панорамні краєвиди на гірські хребти та долини. Такі маршрути займають усього кілька годин і підходять навіть для сімей з дітьми. Подорожуючи вихідного дня, ви зможете насолодитися чарівною тишею лісів, відкрити для себе чисті гірські потоки та відчути особливу атмосферу Карпат без перевтоми.
                    Легкі маршрути – чудовий спосіб розпочати знайомство з горами, відчути ритм природи та зрозуміти, що мандрівка може бути доступною кожному. Карпати надихають і водночас навчають бережно ставитися до довкілля, адже краса цих місць заслуговує на те, щоб залишатися незмінною для наступних поколінь.</p>
                <div>
                    <h3>Збережіть собі історію</h3>
                    <p>Вона буде доступна у вашому профілі у розділі збережене</p>
                    <button>Зберегти</button>
                </div>
            </section>
            {/* recommended section */}
            <section>
                <h2>Вам також сподобається</h2>
                <ul>
                    <li>
                        <img src="" alt="image" />
                        <div>
                            <p></p>
                            <h3>Національний парк «Сколівські Бескиди»: стежками природи</h3>
                            <button>Переглянути статтю</button>
                            <button>
                                <svg xmlns="http://www.w3.org/2000/svg" width="25" height="25" viewBox="0 0 25 25" fill="none">
                                    <path d="M12.3336 18.4504L7.56508 20.4904C6.99742 20.7351 6.45867 20.6892 5.94883 20.3527C5.439 20.0162 5.18408 19.54 5.18408 18.9242V4.71169C5.18408 4.25002 5.353 3.84977 5.69083 3.51094C6.0285 3.17194 6.42733 3.00244 6.88733 3.00244H17.7798C18.2415 3.00244 18.6417 3.17194 18.9806 3.51094C19.3196 3.84977 19.4891 4.25002 19.4891 4.71169V18.9242C19.4891 19.54 19.2332 20.0162 18.7213 20.3527C18.2095 20.6892 17.6697 20.7351 17.1021 20.4904L12.3336 18.4504ZM12.3336 16.6282L17.7798 18.9242V4.71169H6.88733V18.9242L12.3336 16.6282ZM12.3336 4.71169H6.88733H17.7798H12.3336Z" fill="black" />
                                </svg>
                            </button>
                        </div>
                    </li>
                    <li>
                        <img src="" alt="image" />
                        <div>
                            <p></p>
                            <h3>Еко-подорожі Дністром: від села до каньйонів</h3>
                            <button>Переглянути статтю</button>
                            <button>
                                <svg xmlns="http://www.w3.org/2000/svg" width="25" height="25" viewBox="0 0 25 25" fill="none">
                                    <path d="M12.3336 18.4504L7.56508 20.4904C6.99742 20.7351 6.45867 20.6892 5.94883 20.3527C5.439 20.0162 5.18408 19.54 5.18408 18.9242V4.71169C5.18408 4.25002 5.353 3.84977 5.69083 3.51094C6.0285 3.17194 6.42733 3.00244 6.88733 3.00244H17.7798C18.2415 3.00244 18.6417 3.17194 18.9806 3.51094C19.3196 3.84977 19.4891 4.25002 19.4891 4.71169V18.9242C19.4891 19.54 19.2332 20.0162 18.7213 20.3527C18.2095 20.6892 17.6697 20.7351 17.1021 20.4904L12.3336 18.4504ZM12.3336 16.6282L17.7798 18.9242V4.71169H6.88733V18.9242L12.3336 16.6282ZM12.3336 4.71169H6.88733H17.7798H12.3336Z" fill="black" />
                                </svg>
                            </button>
                        </div>
                    </li>
                    <li>
                        <img src="" alt="image" />
                        <div>
                            <p></p>
                            <h3>Національний парк Синевир: озеро серед гір</h3>
                            <button>Переглянути статтю</button>
                            <button>
                                <svg xmlns="http://www.w3.org/2000/svg" width="25" height="25" viewBox="0 0 25 25" fill="none">
                                    <path d="M12.3336 18.4504L7.56508 20.4904C6.99742 20.7351 6.45867 20.6892 5.94883 20.3527C5.439 20.0162 5.18408 19.54 5.18408 18.9242V4.71169C5.18408 4.25002 5.353 3.84977 5.69083 3.51094C6.0285 3.17194 6.42733 3.00244 6.88733 3.00244H17.7798C18.2415 3.00244 18.6417 3.17194 18.9806 3.51094C19.3196 3.84977 19.4891 4.25002 19.4891 4.71169V18.9242C19.4891 19.54 19.2332 20.0162 18.7213 20.3527C18.2095 20.6892 17.6697 20.7351 17.1021 20.4904L12.3336 18.4504ZM12.3336 16.6282L17.7798 18.9242V4.71169H6.88733V18.9242L12.3336 16.6282ZM12.3336 4.71169H6.88733H17.7798H12.3336Z" fill="black" />
                                </svg>
                            </button>
                        </div>
                    </li>
                </ul>
            </section>
            <Footer />
        </div>
    )
}